cf_billing/InformationRegisters/энргАктивностьТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Техническая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНаправлениеИспользованияТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНаправлениеИспользованияТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовУчетаАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоставщикиУслугАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоставщикиУслугАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВидыДифференцированностиПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВидыДифференцированностиПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРасчетныеСпособыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРасчетныеСпособыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасчетныйСпособ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьФормулуВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/энргСостояниеТочекУчета/Ext/Module.bsl
#Область ПрограмныйИнтерфейс

Функция ДействующиеТочкиИИхПриборы(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт 
	
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));	
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("АбонентВладелец", "КлючПомещения")));
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета"	, "ТочкаУчета")		, Неопределено));
	КонецЕсли;
	
	Если ПараметрыОтбора = Неопределено Тогда
		Параметры 		= Новый Структура;	
	Иначе
		Параметры		= ПараметрыОтбора;
	КонецЕсли;
	
	Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		 Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры);
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПоПриборамИтог.Организация КАК Организация,
		|	ДанныеПоПриборамИтог.Район КАК Район,
		|	ДанныеПоПриборамИтог.КлючПомещения КАК КлючПомещения,
		|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
		|	ДанныеПоПриборамИтог.РодительТочкиУчета КАК РодительТочкиУчета,
		|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
		|	ДанныеПоПриборамИтог.Услуга КАК Услуга,
		|	ДанныеПоПриборамИтог.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ДанныеПоПриборамИтог.ВидДифференцированности КАК ВидДифференцированности,
		|	ДанныеПоПриборамИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеПоПриборамИтог.РасчетПоФормуле КАК РасчетПоФормуле,
		|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеПоПриборамИтог.Поставщик КАК Поставщик,
		|	ДанныеПоПриборамИтог.НомерПломбы КАК НомерПломбы,
		|	ДанныеПоПриборамИтог.ДатаПоверки КАК ДатаПоверки,
		|	ДанныеПоПриборамИтог.СоставнаяУслуга КАК СоставнаяУслуга
		|ИЗ
		|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Район,
		|	КлючПомещения,
		|	РодительТочкиУчета,
		|	ТочкаУчета,
		|	Шкала"); 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);	
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",		Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",		ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",	ТочкаУчета);
	КонецЕсли;
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
			
КонецФункции

Функция ДействующиеТочкиБезПрибораУчета(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт 
	
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));	
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("АбонентВладелец", "КлючПомещения")));
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета"	, "ТочкаУчета")		, Неопределено));
	КонецЕсли;
	
	Если ПараметрыОтбора = Неопределено Тогда
		Параметры 		= Новый Структура;	
	Иначе
		Параметры		= ПараметрыОтбора;
	КонецЕсли;
	
	Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		 Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещенияБезПУ(Схема, Параметры, "АктивныеТочкиУчетаПомещенияБезПУ");
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема, Параметры, "УслугиДействующихТочек");
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема, Параметры, "НаправлениеИспользованияДействующихТочек"); 
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктивныеТочкиУчетаПомещенияБезПУ.Организация КАК Организация,
		|	АктивныеТочкиУчетаПомещенияБезПУ.Район КАК Район,
		|	АктивныеТочкиУчетаПомещенияБезПУ.КлючПомещения КАК КлючПомещения,
		|	АктивныеТочкиУчетаПомещенияБезПУ.ТочкаУчета КАК ТочкаУчета,
		|	ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
		|	ЕСТЬNULL(НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ
		|ИЗ
		|	АктивныеТочкиУчетаПомещенияБезПУ КАК АктивныеТочкиУчетаПомещенияБезПУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
		|		ПО АктивныеТочкиУчетаПомещенияБезПУ.Организация = УслугиДействующихТочек.Организация
		|			И АктивныеТочкиУчетаПомещенияБезПУ.Район = УслугиДействующихТочек.Район
		|			И АктивныеТочкиУчетаПомещенияБезПУ.КлючПомещения = УслугиДействующихТочек.КлючПомещения
		|			И АктивныеТочкиУчетаПомещенияБезПУ.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
		|		ПО АктивныеТочкиУчетаПомещенияБезПУ.Организация = НаправлениеИспользованияДействующихТочек.Организация
		|			И АктивныеТочкиУчетаПомещенияБезПУ.Район = НаправлениеИспользованияДействующихТочек.Район
		|			И АктивныеТочкиУчетаПомещенияБезПУ.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
		|			И АктивныеТочкиУчетаПомещенияБезПУ.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Район,
		|	КлючПомещения,
		|	ТочкаУчета"); 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);	
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",		Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",		ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",	ТочкаУчета);
	КонецЕсли;
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
			
КонецФункции

Функция УслугиДействующихТочек(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт 
	
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));	
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("АбонентВладелец", "КлючПомещения")));
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета"	, "ТочкаУчета")		, Неопределено));
	КонецЕсли;
	
	Если ПараметрыОтбора = Неопределено Тогда
		Параметры 		= Новый Структура;	
	Иначе
		Параметры		= ПараметрыОтбора;
	КонецЕсли;
	
	Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		 Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема,Параметры,"УслугиДействующихТочек");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УслугиДействующихТочек.Организация КАК Организация,
		|	УслугиДействующихТочек.Район КАК Район,
		|	УслугиДействующихТочек.КлючПомещения КАК КлючПомещения,
		|	УслугиДействующихТочек.ТочкаУчета КАК ТочкаУчета,
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, УслугиДействующихТочек.Услуга) КАК Услуга,
		|	УслугиДействующихТочек.Техническая КАК Техническая
		|ИЗ
		|	УслугиДействующихТочек КАК УслугиДействующихТочек
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО УслугиДействующихТочек.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УслугиДействующихТочек.Организация,
		|	УслугиДействующихТочек.Район,
		|	УслугиДействующихТочек.Техническая,
		|	УслугиДействующихТочек.КлючПомещения,
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, УслугиДействующихТочек.Услуга),
		|	УслугиДействующихТочек.ТочкаУчета"); 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);	
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",		Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",		ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",	ТочкаУчета);
	КонецЕсли;
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
			
КонецФункции

Процедура ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры) Экспорт 
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема,Параметры,"ДействующиеПриборыУчетаПомещения");
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема,Параметры,"УслугиДействующихТочек");
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема,Параметры,"НаправлениеИспользованияДействующихТочек");
	РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиУслугДействующихТочек(Схема,Параметры,"ПоставщикиУслугДействующихТочек");
	РегистрыСведений.энргВидыДифференцированностиПриборовУчета.ВидДифференцированностиВведенныхПриборов(Схема,Параметры,"ВидДифференцированностиВведенныхПриборов");
	РегистрыСведений.энргРасчетныеСпособыТочекУчета.ДействующиеТочкиТочкиПоФормуле(Схема,Параметры,"ДействующиеТочкиТочкиПоФормуле");
	
	// Пломбы исключены т.к их может быть несколько на прибор
	//РегистрыСведений.энргНомерПломбПриборовУчета.НомераПломбВведенныхПриборовДействующихТочек(Схема,Параметры,"НомераПломбВведенныхПриборовДействующихТочек");
	РегистрыСведений.энргДатыПоверкиПрибораУчета.ДатыПоверокДействующихПриборовУчета(Схема,Параметры,"ДатыПоверкиВведенныхПриборовДействующихТочек");
	РегистрыСведений.энргРодительТочкиУчета.АктуальныеРодителиТочекУчета(Схема,Параметры,"АктуальныеРодителиТочекУчета");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Район КАК Район,
		|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
		|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	ВложенныйЗапрос.РодительТочкиУчета КАК РодительТочкиУчета,
		|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
		|	ЕСТЬNULL(энргВидыКанальностиШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
		|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер
		|ПОМЕСТИТЬ ДанныеПоПриборам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		ВложенныйЗапрос.Район КАК Район,
		|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
		|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
		|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|		ВложенныйЗапрос.РодительТочкиУчета КАК РодительТочкиУчета,
		|		ЕСТЬNULL(энргПриборыУчетаАбонента.ВидКанальности, ЗНАЧЕНИЕ(Справочник.энргВидыКанальности.ПустаяСсылка)) КАК ВидКанальности,
		|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
		|		энргПриборыУчетаАбонента.Код КАК ЗаводскойНомер
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ДействующиеТочки.Организация КАК Организация,
		|			ДействующиеТочки.Район КАК Район,
		|			ДействующиеТочки.КлючПомещения КАК КлючПомещения,
		|			ДействующиеТочки.ТочкаУчета КАК ТочкаУчета,
		|			ЕСТЬNULL(ДействующиеПриборыУчетаПомещения.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ПриборУчета,
		|			ЕСТЬNULL(АктуальныеРодителиТочекУчета.РодительТочкиУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК РодительТочкиУчета
		|		ИЗ
		|			ДействующиеТочки КАК ДействующиеТочки
		|				ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения
		|				ПО ДействующиеТочки.Организация = ДействующиеПриборыУчетаПомещения.Организация
		|					И ДействующиеТочки.Район = ДействующиеПриборыУчетаПомещения.Район
		|					И ДействующиеТочки.КлючПомещения = ДействующиеПриборыУчетаПомещения.КлючПомещения
		|					И ДействующиеТочки.ТочкаУчета = ДействующиеПриборыУчетаПомещения.ТочкаУчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеРодителиТочекУчета КАК АктуальныеРодителиТочекУчета
		|				ПО ДействующиеТочки.Организация = АктуальныеРодителиТочекУчета.Организация
		|					И ДействующиеТочки.Район = АктуальныеРодителиТочекУчета.Район
		|					И ДействующиеТочки.КлючПомещения = АктуальныеРодителиТочекУчета.КлючПомещения
		|					И ДействующиеТочки.ТочкаУчета = АктуальныеРодителиТочекУчета.ТочкаУчета) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|			ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
		|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Вложенныйзапрос.Организация КАК Организация,
		|	Вложенныйзапрос.Район КАК Район,
		|	Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
		|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
		|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
		|	Вложенныйзапрос.РодительТочкиУчета КАК РодительТочкиУчета,
		|	Вложенныйзапрос.Шкала КАК Шкала,
		|	Вложенныйзапрос.Услуга КАК Услуга,
		|	Вложенныйзапрос.РегистрируетОбъем КАК РегистрируетОбъем,
		|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
		|	Вложенныйзапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	Вложенныйзапрос.РасчетПоФормуле КАК РасчетПоФормуле,
		|	Вложенныйзапрос.ЗаводскойНомер КАК ЗаводскойНомер,
		|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ЕСТЬNULL(ПоставщикиУслугДействующихТочек.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК Поставщик,
		|	"""" КАК НомерПломбы,
		|	ЕСТЬNULL(ДатыПоверкиВведенныхПриборовДействующихТочек.ДатаПоверки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоверки,
		|	ЕСТЬNULL(энргВидыУслуг.СоставнаяУслуга, ЛОЖЬ) КАК СоставнаяУслуга
		|ПОМЕСТИТЬ ДанныеПоПриборамИтог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеПоПриборам.Организация КАК Организация,
		|		ДанныеПоПриборам.Район КАК Район,
		|		ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
		|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
		|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
		|		ДанныеПоПриборам.РодительТочкиУчета КАК РодительТочкиУчета,
		|		ДанныеПоПриборам.Шкала КАК Шкала,
		|		ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
		|		ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
		|		ЕСТЬNULL(НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ,
		|		НЕ ДействующиеТочкиТочкиПоФормуле.ТочкаУчета ЕСТЬ NULL КАК РасчетПоФормуле,
		|		ДанныеПоПриборам.РегистрируетОбъем КАК РегистрируетОбъем,
		|		ДанныеПоПриборам.ЗаводскойНомер КАК ЗаводскойНомер
		|	ИЗ
		|		ДанныеПоПриборам КАК ДанныеПоПриборам
		|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
		|			ПО ДанныеПоПриборам.Организация = УслугиДействующихТочек.Организация
		|				И ДанныеПоПриборам.Район = УслугиДействующихТочек.Район
		|				И ДанныеПоПриборам.КлючПомещения = УслугиДействующихТочек.КлючПомещения
		|				И ДанныеПоПриборам.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
		|			ПО ДанныеПоПриборам.Организация = НаправлениеИспользованияДействующихТочек.Организация
		|				И ДанныеПоПриборам.Район = НаправлениеИспользованияДействующихТочек.Район
		|				И ДанныеПоПриборам.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
		|				И ДанныеПоПриборам.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеТочкиТочкиПоФормуле КАК ДействующиеТочкиТочкиПоФормуле
		|			ПО ДанныеПоПриборам.Организация = ДействующиеТочкиТочкиПоФормуле.Организация
		|				И ДанныеПоПриборам.Район = ДействующиеТочкиТочкиПоФормуле.Район
		|				И ДанныеПоПриборам.КлючПомещения = ДействующиеТочкиТочкиПоФормуле.КлючПомещения
		|				И ДанныеПоПриборам.ТочкаУчета = ДействующиеТочкиТочкиПоФормуле.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
		|			ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
		|				И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
		|				И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
		|				И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
		|				И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
		|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоставщикиУслугДействующихТочек КАК ПоставщикиУслугДействующихТочек
		|		ПО Вложенныйзапрос.Организация = ПоставщикиУслугДействующихТочек.Организация
		|			И Вложенныйзапрос.Район = ПоставщикиУслугДействующихТочек.Район
		|			И Вложенныйзапрос.ТочкаУчета = ПоставщикиУслугДействующихТочек.ТочкаУчета
		|			И Вложенныйзапрос.КлючПомещения = ПоставщикиУслугДействующихТочек.КлючПомещения
		|			И Вложенныйзапрос.Услуга = ПоставщикиУслугДействующихТочек.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоверкиВведенныхПриборовДействующихТочек КАК ДатыПоверкиВведенныхПриборовДействующихТочек
		|		ПО Вложенныйзапрос.ПриборУчета = ДатыПоверкиВведенныхПриборовДействующихТочек.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ПО Вложенныйзапрос.Услуга = энргВидыУслуг.Ссылка");
КонецПроцедуры

Функция ТочкиОРПиИхПриборы(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт 
	
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));	
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета"	, "ТочкаУчета")		, Неопределено));
	КонецЕсли;
	
	Если ПараметрыОтбора = Неопределено Тогда
		Параметры 		= Новый Структура;	
	Иначе
		Параметры		= ПараметрыОтбора;
	КонецЕсли;
	
	Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		 Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	Параметры.Вставить("ТочкиОРП"	, Истина);
	
	ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры);
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПоПриборамИтог.Организация КАК Организация,
		|	ДанныеПоПриборамИтог.Район КАК Район,
		|	ДанныеПоПриборамИтог.КлючПомещения КАК КлючПомещения,
		|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
		|	ДанныеПоПриборамИтог.РодительТочкиУчета КАК РодительТочкиУчета,
		|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
		|	ДанныеПоПриборамИтог.Услуга КАК Услуга,
		|	ДанныеПоПриборамИтог.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ДанныеПоПриборамИтог.ВидДифференцированности КАК ВидДифференцированности,
		|	ДанныеПоПриборамИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеПоПриборамИтог.РасчетПоФормуле КАК РасчетПоФормуле,
		|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеПоПриборамИтог.Поставщик КАК Поставщик,
		|	ДанныеПоПриборамИтог.НомерПломбы КАК НомерПломбы,
		|	ДанныеПоПриборамИтог.ДатаПоверки КАК ДатаПоверки,
		|	ДанныеПоПриборамИтог.СоставнаяУслуга КАК СоставнаяУслуга
		|ИЗ
		|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Район,
		|	КлючПомещения,
		|	РодительТочкиУчета,
		|	ТочкаУчета,
		|	Шкала"); 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);	
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",		Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",		ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",	ТочкаУчета);
	КонецЕсли;
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
			
КонецФункции

#КонецОбласти
